src/Catalogs/ВерсииКонфигурации/ВерсииКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииКонфигурации</name>
  <owners>Catalog.Конфигурации</owners>
  <attributes>
    <name>ВерсияЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Релизная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ОбъектыБлокировок/ОбъектыБлокировок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыБлокировок</name>
  <resources>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ВерсииКонфигурации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция СоздатьЭлементПоНаименованию(Наименование, Владелец) Экспорт
	Результат = РезультатЗапросаПоНаименованию(Наименование, Владелец);
	Если Результат.Пустой() Тогда
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОбъектыБлокировок");
			ЭлементБлокировки.УстановитьЗначение("Объект", "Справочник.ВерсииКонфигурации." + Наименование);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
		Исключение
			ВызватьИсключение "Центр мониторинга. Ожидаемая управляемая блокировка при создании элемента справочника 'ВерсииКонфигурации'";
		КонецПопытки;
		
		Результат = РезультатЗапросаПоНаименованию(Наименование, Владелец);
		Если Результат.Пустой() Тогда
			НовыйЭлемент = Справочники.ВерсииКонфигурации.СоздатьЭлемент();
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Наименование = Наименование;
			НовыйЭлемент.Владелец = Владелец;
			НовыйЭлемент.Записать();
			
			РезультатВыполнения = НовыйЭлемент.Ссылка;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			РезультатВыполнения = Выборка.Ссылка;
		КонецЕсли;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		РезультатВыполнения = Выборка.Ссылка;
	КонецЕсли;
		
	Возврат РезультатВыполнения;
КонецФункции

Функция РезультатЗапросаПоНаименованию(Наименование, Владелец)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВерсииКонфигурации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВерсииКонфигурации КАК ВерсииКонфигурации
	               |ГДЕ
	               |	ВерсииКонфигурации.Наименование = &Наименование
	               |	И ВерсииКонфигурации.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

#КонецЕсли
